{
    "model": {
        "output_layers": [
            [
                "conv4",
                0,
                0
            ]
        ],
        "name": "CNN",
        "input_layers": [
            [
                "input_14",
                0,
                0
            ]
        ],
        "layers": [{
            "class_name": "InputLayer",
            "name": "input_14",
            "inbound_nodes": [],
            "config": {
                "input_dtype": "float32",
                "name": "input_14",
                "sparse": false,
                "batch_input_shape": [
                    null,
                    1,
                    64,
                    64
                ]
            }
        }, {
            "class_name": "Convolution2D",
            "name": "conv1_1",
            "inbound_nodes": [
                [
                    [
                        "input_14",
                        0,
                        0
                    ]
                ]
            ],
            "config": {
                "nb_filter": 32,
                "name": "conv1_1",
                "W_constraint": null,
                "nb_row": 3,
                "nb_col": 3,
                "b_regularizer": null,
                "W_regularizer": null,
                "init": "glorot_uniform",
                "trainable": true,
                "activation": "relu",
                "border_mode": "same",
                "activity_regularizer": null,
                "subsample": [
                    1,
                    1
                ],
                "dim_ordering": "th",
                "b_constraint": null,
                "bias": true
            }
        }, {
            "class_name": "Convolution2D",
            "name": "conv1_2",
            "inbound_nodes": [
                [
                    [
                        "conv1_1",
                        0,
                        0
                    ]
                ]
            ],
            "config": {
                "nb_filter": 32,
                "name": "conv1_2",
                "W_constraint": null,
                "nb_row": 3,
                "nb_col": 3,
                "b_regularizer": null,
                "W_regularizer": null,
                "init": "glorot_uniform",
                "trainable": true,
                "activation": "relu",
                "border_mode": "same",
                "activity_regularizer": null,
                "subsample": [
                    1,
                    1
                ],
                "dim_ordering": "th",
                "b_constraint": null,
                "bias": true
            }
        }, {
            "class_name": "MaxPooling2D",
            "name": "pool1",
            "inbound_nodes": [
                [
                    [
                        "conv1_2",
                        0,
                        0
                    ]
                ]
            ],
            "config": {
                "pool_size": [
                    2,
                    2
                ],
                "border_mode": "valid",
                "trainable": true,
                "name": "pool1",
                "dim_ordering": "th",
                "strides": [
                    2,
                    2
                ]
            }
        }, {
            "class_name": "Convolution2D",
            "name": "convolution2d_160",
            "inbound_nodes": [
                [
                    [
                        "pool1",
                        0,
                        0
                    ]
                ]
            ],
            "config": {
                "nb_filter": 64,
                "name": "convolution2d_160",
                "W_constraint": null,
                "nb_row": 3,
                "nb_col": 3,
                "b_regularizer": null,
                "W_regularizer": null,
                "init": "glorot_uniform",
                "trainable": true,
                "activation": "relu",
                "border_mode": "same",
                "activity_regularizer": null,
                "subsample": [
                    1,
                    1
                ],
                "dim_ordering": "th",
                "b_constraint": null,
                "bias": true
            }
        }, {
            "class_name": "Convolution2D",
            "name": "convolution2d_161",
            "inbound_nodes": [
                [
                    [
                        "convolution2d_160",
                        0,
                        0
                    ]
                ]
            ],
            "config": {
                "nb_filter": 64,
                "name": "convolution2d_161",
                "W_constraint": null,
                "nb_row": 3,
                "nb_col": 3,
                "b_regularizer": null,
                "W_regularizer": null,
                "init": "glorot_uniform",
                "trainable": true,
                "activation": "relu",
                "border_mode": "same",
                "activity_regularizer": null,
                "subsample": [
                    1,
                    1
                ],
                "dim_ordering": "th",
                "b_constraint": null,
                "bias": true
            }
        }, {
            "class_name": "MaxPooling2D",
            "name": "maxpooling2d_36",
            "inbound_nodes": [
                [
                    [
                        "convolution2d_161",
                        0,
                        0
                    ]
                ]
            ],
            "config": {
                "pool_size": [
                    2,
                    2
                ],
                "border_mode": "valid",
                "trainable": true,
                "name": "maxpooling2d_36",
                "dim_ordering": "th",
                "strides": [
                    2,
                    2
                ]
            }
        }, {
            "class_name": "Convolution2D",
            "name": "convolution2d_162",
            "inbound_nodes": [
                [
                    [
                        "maxpooling2d_36",
                        0,
                        0
                    ]
                ]
            ],
            "config": {
                "nb_filter": 128,
                "name": "convolution2d_162",
                "W_constraint": null,
                "nb_row": 3,
                "nb_col": 3,
                "b_regularizer": null,
                "W_regularizer": null,
                "init": "glorot_uniform",
                "trainable": true,
                "activation": "relu",
                "border_mode": "same",
                "activity_regularizer": null,
                "subsample": [
                    1,
                    1
                ],
                "dim_ordering": "th",
                "b_constraint": null,
                "bias": true
            }
        }, {
            "class_name": "Convolution2D",
            "name": "convolution2d_163",
            "inbound_nodes": [
                [
                    [
                        "convolution2d_162",
                        0,
                        0
                    ]
                ]
            ],
            "config": {
                "nb_filter": 128,
                "name": "convolution2d_163",
                "W_constraint": null,
                "nb_row": 3,
                "nb_col": 3,
                "b_regularizer": null,
                "W_regularizer": null,
                "init": "glorot_uniform",
                "trainable": true,
                "activation": "relu",
                "border_mode": "same",
                "activity_regularizer": null,
                "subsample": [
                    1,
                    1
                ],
                "dim_ordering": "th",
                "b_constraint": null,
                "bias": true
            }
        }, {
            "class_name": "MaxPooling2D",
            "name": "maxpooling2d_37",
            "inbound_nodes": [
                [
                    [
                        "convolution2d_163",
                        0,
                        0
                    ]
                ]
            ],
            "config": {
                "pool_size": [
                    2,
                    2
                ],
                "border_mode": "valid",
                "trainable": true,
                "name": "maxpooling2d_37",
                "dim_ordering": "th",
                "strides": [
                    2,
                    2
                ]
            }
        }, {
            "class_name": "Convolution2D",
            "name": "conv4",
            "inbound_nodes": [
                [
                    [
                        "maxpooling2d_37",
                        0,
                        0
                    ]
                ]
            ],
            "config": {
                "nb_filter": 1,
                "name": "conv4",
                "W_constraint": null,
                "nb_row": 1,
                "nb_col": 1,
                "b_regularizer": null,
                "W_regularizer": null,
                "init": "glorot_uniform",
                "trainable": true,
                "activation": "sigmoid",
                "border_mode": "valid",
                "activity_regularizer": null,
                "subsample": [
                    1,
                    1
                ],
                "dim_ordering": "th",
                "b_constraint": null,
                "bias": true
            }
        }]
    },
    "id": "p0001",
    "ui_network_editor": "NN",
    "creator": "general",
    "prob_dodmain": 3,
    "train_params": {
        "learning rate": 0.00001,
        "loss": "categorical_crossentropy",
        "batch_size": 32,
        "SBO": true,
        "optimizer": "Adam",
        "epochs": 100,
        "metrics": "categorical_crossentropy"
        "example2": {
          "field1": 1
        }
    },
    "root": "keras",
    "alg_name": "CNN"
}
